Revit 2027 API
WorksharingUtils.CheckoutWorksets Method
Overload List
Name | Description
CheckoutWorksets(Document, ICollection<WorksetId>) |  Obtains ownership for the current user of as many specified worksets as possible.
CheckoutWorksets(Document, ISet<WorksetId>, TransactWithCentralOptions) |  Obtains ownership for the current user of as many specified worksets as possible.
Top
See Also
Reference
WorksharingUtils Class
Autodesk.Revit.DB Namespace